<unk>	0
<s>	0
</s>	0
.	-2.88174
,	-4.1
▁	-4.3136
을	-4.64295
를	-4.66091
▁1	-4.7479
의	-4.78879
가	-4.82244
▁0	-4.8858
이	-4.95624
)	-5.0089
는	-5.0326
▁감사합니다	-5.05653
(	-5.05883
▁수	-5.15392
▁2	-5.33669
로	-5.4111
!	-5.46966
에	-5.51479
...	-5.55347
?	-5.59
▁것	-5.60753
▁=	-5.6182
▁3	-5.64146
도	-5.67124
[	-5.72175
▁있습니다	-5.7642
/	-5.79545
은	-5.80358
▁이	-5.82938
▁(	-5.84426
으로	-5.91273
i	-5.93241
▁4	-5.95265
▁됩니다	-5.96282
n	-5.98369
]	-5.98778
▁때	-6.00015
▁같습니다	-6.00623
번째	-6.09268
▁5	-6.10825
_	-6.12607
만	-6.12929
에서	-6.1322
▁때문에	-6.19149
://	-6.20457
▁합니다	-6.22064
▁있는	-6.25625
▁i	-6.25635
번	-6.25663
:	-6.32243
▁경우	-6.33555
▁a	-6.34177
▁더	-6.36221
▁그	-6.37128
▁n	-6.37376
▁+	-6.42765
▁한	-6.43872
▁잘	-6.46617
▁안	-6.4721
▁int	-6.47217
▁같은	-6.5056
▁10	-6.50742
▁"	-6.51759
1	-6.52663
인	-6.53248
입니다	-6.54337
와	-6.54498
"	-6.55698
;	-6.56237
▁아	-6.56247
▁N	-6.57829
게	-6.58384
▁6	-6.58904
▁:	-6.59101
!!	-6.60922
2	-6.6096
a	-6.61975
()	-6.65384
▁다른	-6.66241
▁for	-6.69156
▁-	-6.70299
▁8	-6.70338
▁문제	-6.70527
▁7	-6.72028
'	-6.73192
▁다시	-6.73261
과	-6.7334
▁if	-6.76419
▁O	-6.76637
▁제가	-6.78105
▁문제가	-6.78979
▁없습니다	-6.79384
www	-6.7948
net	-6.80662
acmicpc	-6.81843
▁입력	-6.81982
▁https	-6.85554
지	-6.86322
N	-6.86861
▁아니라	-6.87858
▁할	-6.88411
▁-1	-6.88424
-	-6.88764
s	-6.8942
▁코드를	-6.89596
▁'	-6.89641
▁@	-6.91241
▁것이	-6.91266
x	-6.92478
▁b	-6.9388
▁두	-6.94013
▁답변	-6.94707
일	-6.94759
고	-6.96502
▁될	-6.96578
▁9	-6.96589
▁C	-6.97447
▁출력	-6.97625
▁정말	-6.97854
3	-6.98874
▁값이	-7.00056
▁ᅲᅲ	-7.00124
b	-7.01697
보다	-7.0178
▁시간	-7.01893
int	-7.02932
▁문제를	-7.04406
▁코드	-7.04731
▁값을	-7.04888
j	-7.05083
▁100	-7.06312
▁x	-7.06625
▁모든	-7.07114
d	-7.07231
까지	-7.07655
▁*	-7.08607
▁수정했습니다	-7.08821
▁==	-7.11891
▁하는	-7.12629
▁않습니다	-7.13221
▁하면	-7.13585
부터	-7.13732
▁<	-7.13884
▁다	-7.13945
▁c	-7.15357
▁모두	-7.15594
▁반례	-7.15954
https	-7.1727
c	-7.17325
▁->	-7.1749
▁A	-7.17654
한	-7.1938
서	-7.21224
▁같이	-7.2191
▁long	-7.2373
▁반례입니다	-7.24393
▁같네요	-7.25438
com	-7.25842
▁j	-7.26275
▁아닌	-7.27356
▁최대	-7.27658
라고	-7.27871
▁코드는	-7.27907
요	-7.28501
▁줄	-7.28952
▁그냥	-7.29153
나	-7.32483
▁{	-7.32657
▁arr	-7.33075
▁해결했습니다	-7.33791
▁어떻게	-7.34104
▁이렇게	-7.34677
▁큰	-7.34846
▁왜	-7.36461
개	-7.36581
▁어떤	-7.36772
▁덕분에	-7.36899
▁가	-7.37064
~	-7.37578
▁너무	-7.3772
▁게	-7.38319
감사합니다	-7.38448
][	-7.38608
y	-7.40348
▁메모리	-7.40411
▁}	-7.41214
▁바로	-7.42437
▁이런	-7.4376
*	-7.43859
▁번	-7.44028
▁가장	-7.45185
▁많이	-7.45213
▁B	-7.45902
▁있을	-7.4603
);	-7.46942
▁잘못	-7.47512
=	-7.48062
▁문제는	-7.48068
++	-7.48388
▁되는	-7.48453
▁저도	-7.4878
+	-7.48945
▁해당	-7.48997
▁문자열	-7.49032
0	-7.49754
▁것입니다	-7.50054
▁배열	-7.5059
A	-7.51143
▁것을	-7.51738
board	-7.51757
면	-7.52313
▁줄에	-7.5253
▁정답	-7.5274
▁k	-7.5383
▁11	-7.53847
k	-7.54329
▁것은	-7.55343
할	-7.56716
▁줄에서	-7.56767
▁를	-7.5678
▁와	-7.57792
라는	-7.58282
▁다음	-7.58312
>	-7.58612
▁%	-7.58961
▁계속	-7.591
개의	-7.59141
▁제	-7.59355
그리고	-7.59432
합니다	-7.59535
▁대한	-7.59837
▁않고	-7.60615
▁수도	-7.60665
▁로	-7.6073
▁dp	-7.6081
▁거	-7.61284
▁감사드립니다	-7.61302
▁하나	-7.6179
▁혹시	-7.61997
<	-7.62147
▁수가	-7.62392
▁답이	-7.62422
▁재채점했습니다	-7.62621
▁없는	-7.62953
▁같아요	-7.63827
▁먼저	-7.64634
▁\	-7.64739
▁에러가	-7.65138
해서	-7.65239
▁20	-7.66904
하는	-7.66966
▁제대로	-7.67564
기	-7.68265
B	-7.68362
▁그리고	-7.68412
▁input	-7.68592
▁테스트	-7.68905
C	-7.69057
▁대해	-7.69556
▁나옵니다	-7.70074
/...	-7.70308
▁입력을	-7.70462
▁건	-7.70483
▁그대로	-7.70783
??	-7.70789
▁한번	-7.71342
▁M	-7.71436
▁ᄒᄒ	-7.72183
인데	-7.72265
▁y	-7.72488
▁scanf	-7.72605
▁각	-7.73196
▁부분이	-7.73352
▁return	-7.73376
▁하고	-7.73673
4	-7.74649
m	-7.74904
▁중	-7.74972
▁s	-7.75393
▁알	-7.75546
▁저	-7.76244
-1	-7.7644
문	-7.76773
▁런타임	-7.77116
▁코드가	-7.7732
▁좀	-7.77975
▁것으로	-7.78336
▁못	-7.78439
▁m	-7.78513
▁초기화	-7.7859
▁in	-7.78699
▁아닙니다	-7.78822
▁않은	-7.78934
▁d	-7.79092
▁아래	-7.79221
네요	-7.79232
▁시간이	-7.79252
하고	-7.79667
▁while	-7.8013
▁해서	-7.81116
▁않는	-7.81313
▁배열의	-7.81376
▁경우가	-7.8141
▁배열을	-7.81723
이고	-7.82021
▁시간초과가	-7.82048
거	-7.82648
▁번째	-7.82872
▁결과	-7.8301
▁max	-7.83623
▁후	-7.84109
다	-7.84418
▁12	-7.8462
▁네	-7.8569
▁위	-7.86038
▁그런	-7.86162
▁이미	-7.86211
▁함수	-7.8661
▁있는데	-7.868
▁>	-7.8706
▁때문입니다	-7.87147
▁범위를	-7.87851
▁입니다	-7.88568
님	-7.88724
▁항상	-7.89502
▁부분을	-7.90009
▁/	-7.90362
▁예제	-7.90468
▁마지막	-7.90558
▁현재	-7.90772
▁같은데	-7.90847
▁1000	-7.90861
▁조건을	-7.91652
5	-7.91823
▁질문	-7.9255
▁하는데	-7.93019
▁들어	-7.93244
▁..	-7.93753
▁저는	-7.94193
이면	-7.94366
에는	-7.94407
▁일단	-7.94772
▁입력이	-7.94818
▁작은	-7.9504
%	-7.95363
▁좋은	-7.96049
▁문제의	-7.96561
▁오류가	-7.96759
▁따라서	-7.96763
▁문제에서	-7.96938
▁채점	-7.97084
ᅲᅲ	-7.97087
▁추가	-7.97451
▁직접	-7.97468
하게	-7.98065
▁해결	-7.9826
▁보세요	-7.9833
출력	-7.98356
▁풀	-7.98812
▁else	-7.99101
▁보면	-7.9927
e	-7.99392
▁맞습니다	-8.00243
▁줄의	-8.00651
▁15	-8.00914
▁되어	-8.02439
▁num	-8.02703
▁char	-8.02948
에서는	-8.02978
[0]	-8.03091
▁<=	-8.03517
▁하지	-8.03609
v	-8.04132
▁경우는	-8.04199
▁이상	-8.04272
▁있을까요	-8.04496
ideone	-8.04714
▁겁니다	-8.04736
▁나오네요	-8.04782
▁있고	-8.05089
▁틀린	-8.05155
▁수를	-8.05681
하면	-8.05743
▁50	-8.06189
▁list	-8.06299
▁또	-8.06752
▁걸	-8.06803
▁리스트	-8.06954
▁보입니다	-8.0766
▁나오는	-8.0768
▁하지만	-8.07733
▁0;	-8.0792
이므로	-8.08304
!!!	-8.09248
▁좋을	-8.09508
▁방법이	-8.09672
▁전부	-8.09896
▁:)	-8.0995
▁30	-8.10091
▁sum	-8.11064
▁첫	-8.11173
▁해야	-8.1132
이기	-8.11543
▁그래서	-8.11976
▁잘못된	-8.12401
▁여러	-8.12638
▁초과	-8.12649
▁이해가	-8.12715
▁처음	-8.12941
▁보고	-8.13006
▁즉	-8.13034
랑	-8.13067
▁조금	-8.1339
r	-8.13458
▁그렇게	-8.13488
h	-8.13866
t	-8.14236
▁되지	-8.14497
▁변수	-8.14603
p	-8.14615
시	-8.14752
▁print	-8.14817
▁되고	-8.15099
",	-8.15117
▁경우를	-8.15157
▁뒤에	-8.15884
▁경우에는	-8.16162
▁크기가	-8.16179
▁길이	-8.16456
▁많은	-8.16659
▁16	-8.16674
."	-8.16699
▁함수를	-8.17057
M	-8.1727
이라고	-8.17314
▁길이가	-8.17439
▁정렬	-8.17452
▁도움이	-8.17588
▁ᅲ	-8.17609
▁//	-8.17825
▁count	-8.17899
▁되면	-8.18162
문을	-8.1822
▁정수	-8.18451
▁데이터	-8.18579
▁알고	-8.18608
▁맨	-8.18662
하지	-8.18668
▁값	-8.18997
▁13	-8.19057
f	-8.19157
▁대해서	-8.19487
▁21	-8.19864
▁발생합니다	-8.20263
+1	-8.20505
▁set	-8.20996
▁초과가	-8.21183
▁cin	-8.21637
▁수정	-8.21934
arr	-8.2194
▁해	-8.2198
▁전체	-8.22024
▁지금	-8.22037
▁있어서	-8.22382
▁실행	-8.2268
▁줄을	-8.22726
▁부분	-8.22748
▁답을	-8.22771
▁[	-8.23006
▁출력이	-8.23139
▁사용	-8.23262
->	-8.233
▁따라	-8.23538
▁방법을	-8.24557
▁아닌가요	-8.24785
▁때는	-8.24891
▁있기	-8.24906
▁보시면	-8.25002
▁으로	-8.25088
▁이유는	-8.25112
▁죄송합니다	-8.25218
해	-8.25439
▁맞았습니다	-8.25637
▁따로	-8.25661
이나	-8.26049
이라는	-8.2609
▁위해	-8.26097
▁...	-8.26194
제가	-8.2631
▁map	-8.2639
수	-8.26638
▁에러	-8.26722
▁코드에서	-8.26797
▁틀렸다고	-8.26813
▁크기를	-8.26892
▁결과가	-8.26918
("%	-8.27123
▁그렇군요	-8.27215
▁경우에	-8.27334
▁min	-8.2773
▁해도	-8.27783
▁cnt	-8.27935
된	-8.28029
▁&	-8.28034
▁printf	-8.28085
▁아래와	-8.28335
줄	-8.28493
▁몇	-8.2863
▁정도	-8.2872
▁문제에	-8.28728
▁사용하는	-8.28804
일때	-8.28805
▁매우	-8.28941
++)	-8.28943
▁알고리즘	-8.29001
▁있었네요	-8.29295
▁#	-8.29378
▁14	-8.29418
▁안에	-8.2963
이렇게	-8.29734
▁v	-8.2983
▁개	-8.30037
정답	-8.3034
▁반례가	-8.30472
다고	-8.30877
▁뒤	-8.30885
▁조건이	-8.31416
▁전에	-8.31466
입력	-8.31517
▁그런데	-8.31966
▁전	-8.32118
7	-8.32166
▁구현	-8.32184
▁코드의	-8.32269
▁필요가	-8.32351
input	-8.32531
▁출력하는	-8.3261
야	-8.32661
▁생각	-8.32727
인지	-8.32841
▁무조건	-8.33668
▁나올	-8.33693
▁&&	-8.33762
▁되네요	-8.33786
초	-8.33801
▁안녕하세요	-8.33883
▁dfs	-8.33925
▁연산	-8.33952
▁드립니다	-8.34153
▁S	-8.34253
그	-8.3436
\	-8.34604
03178	-8.34638
것	-8.34651
▁설명	-8.34759
라	-8.34935
▁없이	-8.35129
▁컴파일	-8.35146
▁p	-8.35366
▁≤	-8.35388
▁생각합니다	-8.35391
▁~	-8.35875
▁처리	-8.35881
▁다음과	-8.36027
▁나머지	-8.36267
^2)	-8.36283
6	-8.36588
▁방법	-8.36715
▁대신	-8.3681
▁에서	-8.3693
됩니다	-8.37125
D	-8.37505
▁범위	-8.37587
▁모르겠습니다	-8.377
▁구하는	-8.37891
▁볼	-8.37973
O	-8.3828
하기	-8.38613
▁최소	-8.38808
▁r	-8.38978
걸	-8.3904
▁무슨	-8.39162
처럼	-8.39191
▁break	-8.39411
▁방문	-8.39482
▁재귀	-8.39589
▁아직	-8.39828
▁range	-8.40108
▁큐에	-8.40229
▁확인	-8.40279
▁그러면	-8.41099
9	-8.41135
▁의	-8.41244
▁차이가	-8.41313
[1]	-8.41428
따라서	-8.42188
▁줄이	-8.42315
▁문자열의	-8.4252
num	-8.4255
건	-8.42683
▁!=	-8.4278
::	-8.42907
▁23	-8.43037
▁맞는	-8.4312
▁했는데	-8.43323
▁식으로	-8.43589
히	-8.43679
값이	-8.43701
▁string	-8.4371
▁있나요	-8.43725
▁입력으로	-8.43726
▁str	-8.44061
▁댓글	-8.441
▁반복문	-8.44158
▁아마	-8.44276
▁제출	-8.44291
l	-8.44391
▁계산	-8.44568
▁ᅮᅮ	-8.4459
▁것도	-8.4461
w	-8.44984
그런데	-8.45035
▁듯	-8.45302
▁반례를	-8.4537
▁데이터를	-8.45467
▁있는지	-8.45676
▁연산을	-8.46229
▁날	-8.46401
▁바랍니다	-8.46456
값을	-8.46585
문제	-8.46648
▁통해	-8.46709
▁숫자	-8.46715
▁만약	-8.46863
▁bfs	-8.46872
▁방식으로	-8.46923
list	-8.46945
억	-8.46952
(1)	-8.47149
▁수는	-8.47318
▁24	-8.47546
▁sort	-8.47762
▁아하	-8.47787
▁cout	-8.4808
▁D	-8.48114
▁BFS	-8.48183
▁마지막에	-8.48342
▁인덱스	-8.48629
진	-8.48662
들을	-8.48694
▁되었습니다	-8.48869
▁있다는	-8.48923
▁쓰는	-8.4906
10	-8.4907
▁1,	-8.49288
▁<<	-8.49441
▁25	-8.49578
▁가지	-8.4964
▁둘	-8.49853
▁되는데	-8.49899
하지만	-8.49966
하여	-8.49999
▁main	-8.50441
▁f	-8.50555
▁주어진	-8.5061
다면	-8.50677
▁32	-8.50701
▁예를	-8.50701
▁원소를	-8.50795
ᅲ	-8.50874
))	-8.51019
▁않을	-8.51233
▁우선	-8.51374
▁00	-8.51794
▁22	-8.51866
위	-8.52146
마다	-8.52311
지만	-8.5235
▁X	-8.52861
▁있으면	-8.52887
▁나는	-8.5291
▁보니	-8.52959
▁sys	-8.53425
if	-8.54041
▁부분에서	-8.54062
▁10000	-8.54426
▁17	-8.54435
▁진짜	-8.54574
▁40	-8.54586
니까	-8.54698
▁라고	-8.55096
▁과정에서	-8.55103
▁위에	-8.55135
▁정답이	-8.55326
▁세	-8.55463
▁일	-8.55499
▁값은	-8.56098
니	-8.56108
▁사용할	-8.56132
▁원소	-8.56135
▁데이터가	-8.56346
▁원래	-8.56351
8	-8.56433
▁visited	-8.56744
▁않나요	-8.56859
▁칸	-8.56934
▁서로	-8.57026
for	-8.57185
▁위의	-8.57269
▁double	-8.57344
▁있네요	-8.57397
▁때마다	-8.57511
▁등	-8.58071
S	-8.58078
▁점	-8.58272
▁pop	-8.58284
▁말고	-8.5853
▁케이스	-8.58585
▁또는	-8.58667
stdin	-8.59198
▁이유	-8.59241
▁부분은	-8.59347
▁있지	-8.59414
▁프로그램	-8.59513
▁개행	-8.59577
▁앗	-8.59634
▁2,	-8.59814
X	-8.59906
그래서	-8.60003
▁있다고	-8.60124
▁기준으로	-8.60172
▁또한	-8.60193
▁했습니다	-8.60261
▁나와야	-8.60351
▁조건	-8.60353
▁총	-8.60443
▁문제입니다	-8.60557
▁각각	-8.60753
▁K	-8.60891
▁오	-8.6093
▁빠른	-8.61009
▁된	-8.61106
▁출력해야	-8.61107
^2	-8.6114
▁비교	-8.61215
는데	-8.61264
형	-8.6137
▁19	-8.61455
▁되어야	-8.6148
군요	-8.61504
▁모르겠지만	-8.61858
▁질문을	-8.61904
라면	-8.62142
▁공백	-8.62196
blog	-8.62218
▁문자	-8.62362
▁굳이	-8.62435
▁함수가	-8.62444
같은	-8.62695
데	-8.62704
▁시간을	-8.63143
이라	-8.63153
▁호출	-8.63212
▁아니고	-8.63258
▁1)	-8.63299
▁result	-8.63304
▁포인터	-8.63365
▁true	-8.63367
▁에	-8.63429
▁않아서	-8.63818
▁않을까요	-8.63826
어	-8.63961
아	-8.64088
▁님	-8.64202
▁루프	-8.64219
▁크기	-8.6433
▁시작	-8.6448
▁소스	-8.64829
▁생각해	-8.65163
▁18	-8.65169
자	-8.65265
▁좋습니다	-8.6557
혹시	-8.65583
▁이거	-8.65603
▁아니면	-8.65764
▁틀렸습니다	-8.65768
..?	-8.65814
▁이유가	-8.65833
▁모르겠네요	-8.65998
▁없을	-8.66074
▁문자가	-8.66182
중	-8.66825
▁가능한	-8.67071
분	-8.67518
▁답	-8.67616
▁있었습니다	-8.67712
▁받을	-8.67949
▁결국	-8.68035
▁T	-8.68044
▁쓰면	-8.68167
())	-8.68217
▁!	-8.68314
▁방법으로	-8.68406
▁이게	-8.68729
▁사실	-8.68824
▁하나의	-8.68996
거나	-8.6905
이런	-8.69152
▁있어요	-8.69184
▁처음에	-8.69211
▁배열에	-8.69217
▁답은	-8.69236
▁26	-8.6925
만큼	-8.69311
▁t	-8.69328
▁아예	-8.69443
▁이제	-8.69483
▁범위가	-8.6955
▁실수	-8.69634
▁문자를	-8.69663
];	-8.6967
▁q	-8.69673
▁있다면	-8.69828
▁31	-8.69913
▁가지고	-8.69953
▁여기서	-8.70058
g	-8.7026
▁index	-8.70287
▁탐색	-8.70368
▁음	-8.70832
▁하기	-8.71079
▁정확히	-8.71343
djm	-8.71395
▁글을	-8.71409
답	-8.71414
▁vector	-8.71472
해야	-8.71504
개가	-8.71647
예를	-8.71696
▁temp	-8.7183
문이	-8.71837
▁개수	-8.71989
▁만들	-8.72073
▁찾는	-8.72716
▁그럼	-8.72944
▁check	-8.73029
▁AC	-8.73033
▁자체가	-8.73198
▁납니다	-8.73476
▁출력을	-8.73696
▁라는	-8.7398
▁사용하면	-8.74059
o	-8.74083
z	-8.74202
제	-8.74274
▁ᄏᄏ	-8.74389
▁풀이	-8.74411
▁하나만	-8.74427
▁중복	-8.74713
습니다	-8.74728
▁>=	-8.74769
▁있지만	-8.75072
▁첫번째	-8.75317
▁시간초과	-8.75346
▁전혀	-8.75395
▁뜨네요	-8.75484
▁넣으면	-8.75491
▁푸는	-8.7562
▁헉	-8.75774
▁가능합니다	-8.76128
되는	-8.7625
.2.	-8.76322
▁건가요	-8.76458
▁언어	-8.76519
▁알고리즘을	-8.76613
개를	-8.76686
▁그렇네요	-8.7672
죠	-8.7686
▁이용해서	-8.7696
▁하나씩	-8.76969
▁근데	-8.77001
▁필요한	-8.7704
R	-8.7707
▁new	-8.77077
▁말	-8.77153
▁스택	-8.77173
▁시	-8.7718
▁반드시	-8.77183
▁ans	-8.77229
▁당연히	-8.77358
▁끝	-8.77371
했습니다	-8.77497
▁선언	-8.77531
max	-8.77869
▁방법은	-8.77885
▁않으면	-8.78157
▁실제로	-8.78254
▁인	-8.78523
▁글	-8.78533
▁변수를	-8.78552
자리	-8.78605
▁내	-8.7884
▁위치	-8.78947
;;	-8.78992
▁될까요	-8.78995
▁순서	-8.79071
▁통과	-8.79091
▁앞에	-8.79132
▁$	-8.79584
readline	-8.79622
E	-8.79943
▁L	-8.80172
▁어느	-8.80253
])	-8.80265
▁트리	-8.80362
size	-8.80704
▁체크	-8.80833
대로	-8.80867
▁이를	-8.80868
▁까지	-8.81181
▁DP	-8.8119
다른	-8.81345
즉	-8.81696
▁the	-8.81726
▁경우의	-8.81737
▁조건에	-8.8183
▁있으니	-8.81843
▁숫자가	-8.8205
답변	-8.82052
하	-8.82103
K	-8.8224
▁훨씬	-8.82255
▁false	-8.82439
11	-8.82483
▁파이썬	-8.82511
▁해결되었습니다	-8.82568
▁주어지는	-8.82646
▁말씀하신	-8.8273
▁나오는데	-8.82811
split	-8.82839
▁분	-8.82879
▁받는	-8.82921
▁출력됩니다	-8.83156
▁?	-8.83271
▁std	-8.83363
▁발생하는	-8.83532
▁queue	-8.83562
▁크게	-8.83925
▁실수를	-8.83969
지는	-8.83994
▁만들어	-8.84029
덕분에	-8.84124
}	-8.84279
▁배열이	-8.84316
▁코드로	-8.8437
다는	-8.84562
==	-8.84585
$	-8.84749
map	-8.8481
▁DFS	-8.84842
▁필요	-8.84925
("	-8.85096
▁새로운	-8.85291
▁다르게	-8.85356
▁그렇습니다	-8.85436
▁예시	-8.85469
▁쓸	-8.85508
▁바꾸면	-8.85527
ms	-8.8559
▁이후	-8.85901
▁1;	-8.85915
하는데	-8.8596
▁R	-8.86046
▁지	-8.86222
▁있다	-8.86224
▁것과	-8.86291
▁하네요	-8.8634
던	-8.86421
▁구	-8.8644
▁구할	-8.86552
▁반복	-8.86565
엔	-8.8657
▁자리	-8.86841
두	-8.87185
시간	-8.872
▁못했네요	-8.87271
',	-8.87292
#	-8.87342
▁아무	-8.87529
▁갈	-8.87719
..!	-8.87777
▁and	-8.87864
2)	-8.87878
▁가는	-8.87878
▁소수	-8.87891
▁생각을	-8.87932
▁저렇게	-8.8803
▁이해	-8.88076
q	-8.88102
문에서	-8.88301
▁공백이	-8.88487
▁is	-8.8878
▁코드에서는	-8.89004
=1	-8.89014
▁없어서	-8.8912
▁45	-8.89123
▁0,	-8.89155
▁len	-8.89181
▁P	-8.89267
[2]	-8.89385
();	-8.8952
▁+=	-8.89525
들이	-8.89668
▁descending	-8.89674
▁strlen	-8.89717
▁줄은	-8.89748
▁ascending	-8.89821
P	-8.89837
▁h	-8.89888
▁매번	-8.89935
include	-8.90256
아래	-8.90441
▁99	-8.90462
▁push	-8.90617
되지	-8.90681
▁테스트케이스	-8.90942
▁나온	-8.91001
▁루프를	-8.91068
차원	-8.91079
▁주세요	-8.91165
▁정상적으로	-8.91178
▁풀었습니다	-8.91206
u	-8.91497
또한	-8.91526
▁링크	-8.91785
▁여전히	-8.91914
T	-8.91987
▁경우도	-8.91999
▁60	-8.92308
주셔서	-8.92516
dp	-8.92544
행	-8.92551
[]	-8.9275
▁단순히	-8.92861
▁도움	-8.9299
▁원소가	-8.92997
▁우선순위	-8.93177
▁쉽게	-8.93231
-1)	-8.93282
▁안됩니다	-8.93525
▁횟수	-8.93531
1,	-8.93602
L	-8.9376
▁오버플로우가	-8.93806
▁꼭	-8.93943
▁stack	-8.9403
적인	-8.94081
▁시간복잡도가	-8.94252
▁해결할	-8.94264
▁역시	-8.9468
▁큐	-8.94707
▁이하	-8.94819
▁거의	-8.94855
▁표현	-8.94925
▁이걸	-8.94946
ᄒᄒ	-8.95075
▁발생할	-8.95215
▁추가로	-8.95257
▁코드에	-8.95291
▁오래	-8.95435
▁실제	-8.95625
상	-8.95644
▁개수를	-8.95693
▁빈	-8.95949
저는	-8.95951
▁정점	-8.9608
▁3,	-8.96349
긴	-8.9663
▁33	-8.96806
▁않아도	-8.97099
▁필요합니다	-8.97134
▁싶습니다	-8.97143
F	-8.9717
▁최악의	-8.97239
▁보통	-8.9737
▁숫자를	-8.97378
▁분들	-8.97418
▁그래도	-8.97491
▁접근	-8.97719
▁프로그램이	-8.97772
때	-8.9789
근데	-8.97969
▁!!	-8.98367
겠죠	-8.98519
str	-8.98564
든	-8.98689
▁개수가	-8.98717
되어	-8.98771
▁line	-8.98857
▁answer	-8.98879
씩	-8.99082
▁코드입니다	-8.99094
12	-8.99141
밖에	-8.99191
▁확인해	-8.99266
20	-8.99296
▁널	-8.99488
▁작성	-8.99637
output	-8.99767
▁미리	-8.99777
▁설정	-8.99787
▁사용하지	-8.9983
▁받은	-8.99924
▁할당	-9.00016
▁차이	-9.00135
▁문자열이	-9.0017
▁케이스가	-9.00196
▁오류	-9.00239
H	-9.00287
▁글자	-9.00443
▁종료	-9.00468
▁바꿔서	-9.00572
▁길이를	-9.00637
▁뭔가	-9.00838
이지만	-9.01062
^^	-9.01237
-1]	-9.01252
▁대회	-9.01339
될	-9.01394
▁오른쪽	-9.01511
▁충분히	-9.01558
인가요	-9.01663
view	-9.01685
<=	-9.01742
▁끝에	-9.01984
용	-9.02072
▁그래프	-9.02073
▁넣고	-9.02088
▁있어야	-9.02353
들	-9.0239
▁'\	-9.02407
만약	-9.02483
▁새로	-9.0252
▁입출력	-9.02588
▁순서대로	-9.02669
▁이동	-9.02671
▁말이	-9.02677
in	-9.02961
proble	-9.02987
▁맞게	-9.03042
▁28	-9.03077
▁거리	-9.03144
▁올바른	-9.03232
▁객체	-9.03426
▁출력합니다	-9.03455
stdio	-9.0346
▁l	-9.03684
▁알파벳	-9.03688
▁함수는	-9.03859
▁받고	-9.03888
▁출력하고	-9.04055
tistory	-9.04148
sort	-9.04201
적으로	-9.04237
100	-9.04242
하도록	-9.043
▁이는	-9.04384
▁출력할	-9.04489
▁약	-9.04518
▁>>	-9.04521
▁이건	-9.04566
▁매	-9.0465
▁나	-9.04866
▁of	-9.05038
▁그걸	-9.05153
▁사람이	-9.05205
▁저장	-9.05256
▁동일한	-9.05511
▁EOF	-9.05575
▁상태	-9.0576
▁Python	-9.05768
▁초기화를	-9.0583
▁제일	-9.05915
▁조언	-9.05916
하시면	-9.05936
정말	-9.06014
▁27	-9.06105
까지의	-9.06192
▁주어진다	-9.06229
▁코딩	-9.06268
▁반례는	-9.06314
▁사이에	-9.06375
▁찾을	-9.06405
V	-9.06405
▁은	-9.06594
▁사용해서	-9.06683
▁과	-9.06719
▁케이스를	-9.06765
▁일이	-9.06864
▁있어	-9.06883
▁않아	-9.06993
▁아무것도	-9.0725
▁곳	-9.07321
때문에	-9.07395
▁다음에	-9.07507
라서	-9.07534
count	-9.07541
▁작성하신	-9.07674
▁^^	-9.0788
▁그게	-9.07934
▁하	-9.07953
▁복사	-9.0799
▁백준	-9.08127
▁밖에	-9.08172
▁라인	-9.08349
▁빠르게	-9.08361
▁없고	-9.08411
▁||	-9.08493
이라면	-9.08657
▁걸리는	-9.08711
저도	-9.08714
▁값으로	-9.08744
겁니다	-9.08754
▁visit	-9.08778
▁연산이	-9.0879
▁하겠습니다	-9.08862
▁똑같이	-9.08901
▁이전	-9.08977
다가	-9.09055
▁이해했습니다	-9.09162
▁특정	-9.09236
도록	-9.0933
▁요청	-9.09489
▁뭐가	-9.09606
▁함수의	-9.09634
▁정렬을	-9.09652
하니까	-9.09703
▁문제에서는	-9.09846
▁후에	-9.09862
▁그러네요	-9.09872
▁검사	-9.09938
▁처리를	-9.10023
▁돌	-9.101
했는데	-9.10142
▁비슷한	-9.10187
▁e	-9.10204
▁29	-9.10224
▁end	-9.10302
하신	-9.10419
▁하시면	-9.10465
▁제한	-9.10493
▁만드는	-9.10524
해도	-9.10528
▁디버깅	-9.10701
▁추가했습니다	-9.11134
▁점수	-9.11142
▁들어가	-9.11335
▁나눈	-9.11368
▁파일	-9.11428
▁변경	-9.1161
ing	-9.11945
▁방향	-9.11984
▁w	-9.12012
----------------	-9.12126
▁공부	-9.12206
값	-9.12278
▁|	-9.12352
대	-9.12374
▁들어갈	-9.12411
I	-9.12425
▁푼	-9.12806
char	-9.12833
▁64	-9.12838
▁체	-9.12873
▁만들어서	-9.12923
▁부분에	-9.13003
▁보다	-9.13062
▁python	-9.131
▁나중에	-9.13437
▁위치를	-9.13655
반례	-9.13683
▁입력은	-9.13706
W	-9.13852
▁아닐까요	-9.13898
▁뜹니다	-9.13967
▁않기	-9.14217
▁찾아	-9.14223
▁두번째	-9.14231
▁맞네요	-9.14563
▁알려주셔서	-9.14568
30	-9.1457
▁똑같은	-9.14641
▁(1	-9.1471
/2	-9.14783
.....	-9.14943
저	-9.15105
▁or	-9.15113
▁업데이트	-9.15167
ed	-9.15171
ᅮᅮ	-9.1538
▁들어올	-9.1538
▁ᄏᄏᄏ	-9.15426
▁없기	-9.15483
▁자료구조	-9.15549
▁http	-9.15553
▁연산자	-9.15606
▁있게	-9.1563
=0	-9.15657
▁인덱스를	-9.1568
▁삭제	-9.15681
▁하게	-9.15779
▁최적화	-9.15858
▁출력하면	-9.1592
들은	-9.15946
):	-9.15955
16	-9.16223
en	-9.16366
▁애초에	-9.16373
▁들어오는	-9.16491
▁의미가	-9.16592
current	-9.16689
코드	-9.16735
string	-9.16901
▁내용을	-9.16976
여	-9.16984
함수	-9.1713
▁안되는	-9.17315
▁ᅲᅲᅲ	-9.17328
▁이상한	-9.17508
▁함수에서	-9.17688
▁것이고	-9.17723
▁101	-9.17749
answer	-9.1777
▁mid	-9.17842
▁되기	-9.17881
▁중에	-9.18043
▁H	-9.18062
▁중간에	-9.18149
안	-9.18293
▁무한	-9.18399
▁뜻입니다	-9.18405
▁출력한다	-9.185
건가요	-9.18579
▁초기화가	-9.18739
▁써서	-9.18742
▁써야	-9.18754
신	-9.18755
▁가능성이	-9.18771
그러면	-9.18873
▁확인해보세요	-9.18917
▁배수	-9.18939
▁=>	-9.18952
▁대로	-9.19065
▁왼쪽	-9.19169
99	-9.19356
현재	-9.19519
이랑	-9.19641
▁처럼	-9.19725
▁추천드립니다	-9.19811
▁버퍼	-9.19818
sum	-9.19939
▁본	-9.19963
with	-9.19966
▁헐	-9.20058
▁size	-9.20096
▁start	-9.2011
▁진행	-9.20162
▁생각이	-9.20188
▁34	-9.20191
질	-9.20327
▁써	-9.2034
▁못합니다	-9.20382
▁하루	-9.20434
▁위해서	-9.20442
▁예제를	-9.20446
▁걸립니다	-9.20546
▁위한	-9.20569
▁안에서	-9.20598
▁걸로	-9.20666
라도	-9.20702
▁음수	-9.20788
▁검색	-9.20807
▁했네요	-9.20814
일단	-9.20848
out	-9.20957
▁바꿔	-9.21222
push	-9.21285
var	-9.21306
rejudg	-9.2143
▁컴파일러	-9.21721
▁틀립니다	-9.21835
▁100000	-9.21898
▁오답	-9.21964
▁아닐	-9.2197
▁원하는	-9.22007
▁않았습니다	-9.22016
점	-9.2204
▁발생	-9.2211
^	-9.22129
▁기본	-9.22284
50	-9.22304
명	-9.22311
▁0)	-9.22424
겠네요	-9.22452
▁있으므로	-9.22548
▁크기는	-9.22632
▁영향	-9.22677
▁사용해야	-9.22933
에선	-9.22935
구	-9.2303
▁나오지	-9.23146
▁상태에서	-9.23205
er	-9.23253
▁생기는	-9.23273
▁위해서는	-9.23277
▁못한	-9.23298
▁F	-9.23341
(0)	-9.23419
back	-9.23551
▁좌표	-9.23717
▁array	-9.2379
듯	-9.23815
▁float	-9.24196
바이트	-9.24234
▁내에	-9.24442
▁to	-9.24444
▁못하고	-9.24488
cnt	-9.2453
까지만	-9.24559
▁에러는	-9.24685
▁해보세요	-9.2475
시면	-9.24802
40	-9.24929
▁난	-9.25128
▁dist	-9.25185
▁처음부터	-9.25194
으면	-9.25285
▁사람	-9.25341
▁간단한	-9.25408
배	-9.25426
▁수행	-9.25477
▁혹은	-9.25579
){	-9.25656
▁번호	-9.25672
▁자세히	-9.25699
http	-9.25772
리	-9.25935
배열	-9.25995
사	-9.26037
▁BOJ	-9.26121
pop	-9.26145
ans	-9.26232
▁아주	-9.26244
▁endl	-9.26272
이니	-9.26348
▁한다는	-9.26435
▁해당하는	-9.26444
▁노드	-9.26453
▁순서가	-9.266
하네요	-9.26649
log	-9.26819
▁연결	-9.26891
원	-9.2692
▁의미	-9.27017
min	-9.27097
▁사용한	-9.27248
▁거리가	-9.27302
0000000000000000	-9.27367
가지	-9.27536
▁봅니다	-9.27634
▁정확한	-9.27732
▁합	-9.2782
')	-9.27902
▁이런식으로	-9.27954
▁80	-9.27968
▁41	-9.28004
▁없다고	-9.28079
Y	-9.28167
▁생각해보세요	-9.2819
하니	-9.28285
▁35	-9.28294
▁입력받는	-9.28296
▁상관	-9.28296
▁않게	-9.28414
▁다릅니다	-9.28575
년	-9.28728
▁넣어	-9.28985
Q	-9.29151
▁탐색을	-9.29164
하면서	-9.29177
전	-9.29265
index	-9.29267
22	-9.29282
▁넣는	-9.29287
▁수의	-9.29485
org	-9.29554
▁TC	-9.29579
14	-9.29582
▁찾았습니다	-9.29603
false	-9.29877
나요	-9.29895
▁z	-9.30411
▁않을까	-9.3047
+1)	-9.30631
=0;	-9.30687
▁벽	-9.3087
▁주신	-9.30937
▁생각하고	-9.31014
▁별	-9.3109
▁했을	-9.31114
▁입력받은	-9.3113
▁입력에	-9.31229
번째줄	-9.31478
한다고	-9.31518
▁문제들	-9.31525
임	-9.31574
().	-9.31585
할때	-9.31663
~~	-9.31772
▁tmp	-9.31781
▁처리가	-9.31986
▁나서	-9.32049
적	-9.3206
▁output	-9.32163
▁단	-9.32221
회	-9.32251
▁넣을	-9.32313
kr	-9.32592
▁있었는데	-9.32665
▁하나를	-9.32682
G	-9.32697
append	-9.32777
▁42	-9.32779
문으로	-9.32782
▁제한이	-9.32833
▁것처럼	-9.32949
▁continue	-9.32949
▁들어가는	-9.33013
▁나오게	-9.33029
▁입력하면	-9.33113
24	-9.3316
▁틀리는	-9.33178
▁들어오면	-9.333
각	-9.33334
▁한다	-9.33366
▁1]	-9.33393
st	-9.33461
▁올려주신	-9.3356
▁sizeof	-9.33574
▁작동	-9.33575
▁이후에	-9.33613
▁쓰고	-9.33616
▁51	-9.33767
형으로	-9.33835
▁수정해서	-9.33931
▁선택	-9.33961
▁재채점	-9.34007
▁내용이	-9.34027
해당	-9.34076
▁맞지	-9.34084
▁어떨까요	-9.34107
▁이용해	-9.34204
source	-9.34257
▁갱신	-9.3454
▁됐습니다	-9.34555
되고	-9.34615
▁value	-9.34674
▁E	-9.34754
▁공백을	-9.34818
▁같고	-9.34888
▁시간복잡도는	-9.34891
▁배열로	-9.34938
▁1000000	-9.34944
▁변환	-9.34997
▁find	-9.35026
end	-9.35046
스	-9.35067
오	-9.35069
▁존재하지	-9.3517
15	-9.35208
▁사용하고	-9.35262
▁되므로	-9.35279
▁점이	-9.35327
▁어	-9.35329
더	-9.35385
▁코드와	-9.35463
▁behavior	-9.35575
치	-9.35582
▁반환	-9.35709
었네요	-9.35761
{	-9.35823
17	-9.35848
▁4,	-9.35887
▁삽입	-9.35897
▁만큼	-9.35899
이네요	-9.35914
건지	-9.35976
▁같아서	-9.35986
▁잘못되었습니다	-9.36037
▁불필요한	-9.36092
▁딱	-9.36097
▁동시에	-9.36257
scanf	-9.36421
[3]	-9.36484
▁과정을	-9.36627
▁정확하게	-9.36714
▁리턴	-9.36757
▁right	-9.3676
13	-9.36826
▁뿐입니다	-9.36972
▁감사하겠습니다	-9.37084
▁다익스트라	-9.37121
▁바꾸고	-9.37144
▁다만	-9.37272
번의	-9.37371
len	-9.37501
에도	-9.37589
▁주셔서	-9.37601
▁경로	-9.37654
▁없다는	-9.37909
▁문자열로	-9.37965
▁djm	-9.38082
................	-9.38152
25	-9.38343
▁만든	-9.38497
▁바꾸는	-9.38514
▁형식	-9.38549
▁구간	-9.3865
▁확인하는	-9.38688
▁예외	-9.38704
▁안되네요	-9.38794
했던	-9.39012
▁문제로	-9.39046
-2	-9.39075
▁상황	-9.39096
려	-9.39233
▁String	-9.39237
18	-9.39373
▁깊이	-9.39399
1)	-9.39499
1000	-9.39828
▁고려	-9.39913
▁V	-9.39981
▁하니	-9.4006
▁그렇다면	-9.401
다시	-9.4011
▁받았습니다	-9.40154
▁나누어	-9.40176
▁void	-9.40288
21	-9.40344
문의	-9.40396
ac	-9.40458
더라도	-9.40515
▁바꾸니	-9.40581
▁자연수	-9.40645
▁오답이	-9.40691
▁및	-9.40867
▁코드도	-9.40888
하려고	-9.40939
▁이전에	-9.40992
▁쓰지	-9.41004
▁내에서	-9.4103
],	-9.41118
▁발생한	-9.41142
▁된다는	-9.41228
▁left	-9.41436
칸	-9.4149
당	-9.41567
▁줄바꿈	-9.41584
▁때까지	-9.41609
▁물론	-9.41722
&	-9.41736
▁쓴	-9.41818
이다	-9.41914
▁보는	-9.41939
주	-9.41961
▁의해	-9.41995
▁알고리즘이	-9.42383
MB	-9.42388
▁궁금합니다	-9.42427
겠습니다	-9.42456
실	-9.42474
▁생각했는데	-9.42485
▁않네요	-9.42509
▁저장하는	-9.42517
▁오타	-9.42519
!!!!	-9.42587
▁읽고	-9.42649
▁순으로	-9.42731
▁말씀	-9.42761
▁하니까	-9.4282
▁앞으로	-9.42854
tie	-9.42865
▁필요는	-9.42901
▁주	-9.43028
▁표시	-9.43031
▁word	-9.4306
▁방식을	-9.43066
Z	-9.43087
▁90	-9.431
정	-9.43138
▁오차가	-9.433
▁null	-9.43336
어차피	-9.43339
▁작거나	-9.43341
▁정도로	-9.43423
▁자신	-9.43436
▁pypy	-9.43515
▁g	-9.43614
▁중요한	-9.43633
▁_	-9.43784
선	-9.4382
32	-9.43824
▁번호를	-9.43853
네	-9.43879
▁없네요	-9.43929
경우	-9.43955
ny	-9.43982
sync	-9.44359
|	-9.44384
▁mod	-9.44408
▁변수에	-9.44495
▁deque	-9.44563
start	-9.4457
▁초기화되지	-9.44615
▁가중치	-9.44627
▁한번에	-9.44628
▁동작	-9.44638
▁확인하고	-9.44786
▁문장	-9.44786
▁증가	-9.44889
▁벡터	-9.44949
들의	-9.45141
▁뭐	-9.45188
▁열	-9.45233
▁36	-9.4524
▁제거	-9.45264
왜	-9.45308
length	-9.45308
번줄	-9.45514
▁55	-9.45609
▁데	-9.45655
▁시간복잡도를	-9.45797
▁배열은	-9.45968
▁undefined	-9.46039
▁틀렸습니다가	-9.46054
했을	-9.46137
▁있겠네요	-9.46152
차	-9.46188
었습니다	-9.46402
▁단순	-9.46406
▁이상의	-9.46481
▁적이	-9.46516
다만	-9.46597
▁의도	-9.46598
▁쉬운	-9.46619
05	-9.46649
▁개행문자	-9.46671
▁소수점	-9.46673
▁해결됐습니다	-9.46678
▁친절한	-9.4668
▁받습니다	-9.4668
▁44	-9.46763
▁나와서	-9.46916
▁갯수	-9.46974
▁확인할	-9.47018
니다	-9.47019
했네요	-9.47049
▁없으면	-9.4711
점을	-9.47191
64	-9.47273
▁대해서는	-9.47294
▁생긴	-9.47453
거에요	-9.47549
▁느립니다	-9.4758
▁관련	-9.47613
▁대입	-9.47623
▁되겠죠	-9.47733
▁그렇지	-9.47747
▁내용	-9.47758
23	-9.4783
next	-9.47905
더니	-9.48032
▁지우고	-9.48158
▁문제인	-9.48162
▁맞은	-9.48324
▁True	-9.48404
▁아니	-9.48459
▁내부	-9.48523
▁생길	-9.48547
▁완전히	-9.48607
▁합이	-9.48611
▁고민	-9.48682
▁앞	-9.48703
▁제한을	-9.48749
▁저런	-9.48819
▁선생님	-9.48824
▁정렬이	-9.48888
▁사이즈	-9.48899
문에	-9.4895
▁올려주세요	-9.49281
▁알았는데	-9.49295
▁풀이를	-9.49344
▁경로를	-9.49361
▁-2	-9.49369
▁하신	-9.49429
temp	-9.49449
▁1,000,000	-9.49451
▁W	-9.4948
▁대충	-9.49524
▁짜	-9.49567
▁받아	-9.49764
▁엔터	-9.49781
26	-9.49799
걸로	-9.49902
드	-9.50018
▁48	-9.5011
▁정답은	-9.50136
75	-9.50169
▁루트	-9.50188
▁같은데요	-9.50218
▁2)	-9.50448
▁맞나요	-9.50589
2,	-9.50591
▁방식이	-9.5072
▁좋겠습니다	-9.50761
▁log	-9.50763
▁ᄒ	-9.50879
▁기본적으로	-9.50907
▁한다면	-9.50973
▁기준	-9.51142
▁부터	-9.51153
함수를	-9.51361
▁여기	-9.5139
▁갑니다	-9.51597
▁기능	-9.51712
단	-9.5184
▁케이스에서	-9.51871
월	-9.51916
▁요구하는	-9.52021
nx	-9.52025
▁결과는	-9.52142
▁밑에	-9.52175
));	-9.52225
▁case	-9.52226
이어야	-9.52379
▁읽어	-9.52407
▁뿐	-9.52415
▁이때	-9.52435
▁부분만	-9.52498
▁System	-9.52513
예제	-9.52587
▁빼	-9.52673
것이	-9.52721
▁클래스	-9.52758
▁문	-9.52791
▁형태	-9.52864
▁참고	-9.52956
▁체크를	-9.53018
▁False	-9.53026
▁없는데	-9.53033
한다는	-9.53122
▁import	-9.53188
19	-9.53201
▁자동으로	-9.53333
▁런타임에러가	-9.53374
▁검수	-9.53379
보다는	-9.53395
▁싶네요	-9.53428
이며	-9.53437
장	-9.53489
▁인해	-9.53515
이라서	-9.53558
▁라이브러리	-9.5359
`	-9.53641
▁컴퓨터	-9.53699
▁같을	-9.53754
그냥	-9.53763
▁I	-9.53787
▁고치면	-9.53834
▁자료형	-9.5399
▁'\0'	-9.54043
여기서	-9.54174
▁통과가	-9.54198
음	-9.54289
▁이해를	-9.54336
▁적은	-9.54373
▁이러한	-9.54381
▁생각해서	-9.54426
▁동적	-9.54451
려면	-9.54453
▁때의	-9.54477
▁node	-9.54506
어요	-9.5457
.1.	-9.54637
에서도	-9.54714
▁한다고	-9.54807
등	-9.54833
▁비교하는	-9.54921
▁오버플로우	-9.54929
▁참고하세요	-9.54938
▁넵	-9.54949
▁순간	-9.54954
▁출력하지	-9.5513
있는	-9.55189
▁자릿수	-9.55255
▁참조	-9.55381
▁수열	-9.55478
▁변수가	-9.55638
▁보장이	-9.55735
▁next	-9.55743
▁Integer	-9.55804
▁부모	-9.55941
▁43	-9.55992
한다	-9.56121
▁줄일	-9.56131
▁반대로	-9.56243
▁되는지	-9.5626
▁39	-9.5635
▁몰라서	-9.56357
]);	-9.56367
문제를	-9.56388
▁않지만	-9.56395
▁최솟값	-9.56397
▁풀이가	-9.56398
▁엄청	-9.56452
▁약간	-9.56468
▁아래에	-9.56529
▁NULL	-9.56549
J	-9.56607
꺼	-9.5661
▁되어서	-9.56642
모든	-9.56661
▁틀리게	-9.56707
▁찾아서	-9.56794
한다면	-9.56858
▁타입	-9.56912
▁만들고	-9.56957
짜리	-9.56977
▁최단거리	-9.56996
▁49	-9.56997
▁split	-9.56998
!!!!!!!!!!!!!!!!	-9.57074
▁남은	-9.57126
▁not	-9.57154
어떤	-9.57192
물론	-9.57192
▁없어	-9.57206
▁어려운	-9.57233
('	-9.57333
▁형태로	-9.57345
까요	-9.57413
▁위치에	-9.57467
그럼	-9.575
었는데	-9.57535
▁가능	-9.5755
에게	-9.57616
▁설명이	-9.57633
▁주석	-9.57698
▁일때	-9.57707
질문	-9.57721
▁굉장히	-9.57739
▁받게	-9.57947
▁받아서	-9.58113
▁위에서	-9.58285
▁시간복잡도	-9.58399
▁식	-9.58404
▁때에는	-9.58478
▁풀고	-9.58613
▁도는	-9.5864
위의	-9.58643
▁이므로	-9.58714
▁노드를	-9.58739
아마	-9.58752
▁기존	-9.58762
▁느린	-9.58774
▁되겠네요	-9.58916
▁이분	-9.5892
▁출력은	-9.58956
는지	-9.58978
▁적용	-9.59004
U	-9.59101
▁칸에	-9.59185
개로	-9.59231
▁긴	-9.59301
first	-9.59362
")	-9.59432
▁풀어	-9.59439
▁참	-9.59445
까	-9.59456
면서	-9.59563
▁요소	-9.59564
▁원	-9.59567
▁문제였네요	-9.59739
print	-9.59886
ᄏᄏ	-9.5989
▁같으면	-9.59906
▁정의	-9.59912
▁질문자님	-9.59916
▁만	-9.59981
▁38	-9.6002
▁넣어서	-9.60022
++;	-9.60128
▁일부	-9.60184
55	-9.60293
1111111111111111	-9.60365
▁한데	-9.60418
▁생각하면	-9.60441
▁있었군요	-9.60497
60	-9.6067
▁해결이	-9.60772
하시는	-9.60785
님이	-9.60785
▁비	-9.6084
언어	-9.61077
▁정보	-9.6109
▁소수가	-9.6111
되면	-9.61172
▁중에서	-9.61251
▁에러를	-9.61268
므로	-9.6127
▁메모리가	-9.61374
▁원인	-9.61448
▁999	-9.61516
▁방식	-9.61521
▁통과했습니다	-9.61537
boj	-9.61588
▁상태로	-9.61661
▁인덱스에	-9.61759
▁해결하였습니다	-9.61846
...?	-9.61905
▁행	-9.61922
이상	-9.62013
▁자기	-9.62058
long	-9.62088
▁'0'	-9.62106
하므로	-9.62107
▁확인했습니다	-9.62109
▁어디서	-9.62133
▁PyPy	-9.62154
▁참고로	-9.6222
하실	-9.62243
???	-9.62274
▁생깁니다	-9.62335
려고	-9.6236
▁방금	-9.62501
하나	-9.62504
▁있던	-9.6251
▁게시판	-9.6263
▁넣어보세요	-9.62698
▁52	-9.62702
▁음수가	-9.62801
배열을	-9.62932
[4]	-9.62961
하려면	-9.62985
▁위치가	-9.6307
▁생각하지	-9.63151
▁위와	-9.63189
▁말씀해주신	-9.63199
▁입력받고	-9.63218
▁소스코드	-9.6333
▁값에	-9.6343
▁+1	-9.63441
▁방향으로	-9.63447
▁출력되는	-9.63464
ᅮ	-9.63466
▁상수	-9.63486
▁각각의	-9.63676
▁번만	-9.63765
▁거리를	-9.63782
▁G	-9.63785
우	-9.63862
▁거에요	-9.63883
▁데이터는	-9.63995
.3.	-9.64005
set	-9.64101
다음	-9.6413
line	-9.64143
▁최대값	-9.64355
▁오차	-9.64392
@	-9.64405
27	-9.64422
▁아무리	-9.64505
▁memset	-9.64535
▁59	-9.64607
=2	-9.64621
▁케이스의	-9.64714
▁없지만	-9.64725
▁해줘야	-9.64742
~!	-9.64761
지금	-9.64789
▁풀면	-9.64806
▁힙	-9.64916
▁높은	-9.64964
건데	-9.65005
▁생성	-9.65136
▁꽤	-9.65208
▁정	-9.65305
번이	-9.65359
▁37	-9.6536
▁NO	-9.65372
▁바꾸니까	-9.65516
▁분이	-9.65694
▁간선	-9.65701
▁못하는	-9.65787
▁java	-9.65799
printf	-9.6588
비트	-9.65885
▁[]	-9.65889
▁맞을	-9.65958
보고	-9.65994
▁없으므로	-9.66031
▁Scanner	-9.66055
▁최대한	-9.66084
하겠습니다	-9.66126
▁그건	-9.66138
문은	-9.66167
▁`	-9.6619
▁오히려	-9.66192
번에	-9.66192
▁자세한	-9.66196
,,,	-9.66199
▁입력받을	-9.66258
▁graph	-9.66379
후	-9.66427
▁고려하지	-9.6647
▁sqrt	-9.66477
번을	-9.6648
▁속도	-9.6653
글자	-9.66547
▁해석	-9.66565
▁범위는	-9.66663
▁아아	-9.66709
//	-9.6671
▁소수를	-9.66724
else	-9.66765
▁마찬가지로	-9.66807
▁통해서	-9.66872
▁간선이	-9.66881
▁시작하는	-9.66888
▁많습니다	-9.66907
+1]	-9.66963
▁MAX	-9.67024
▁에라토스테네스의	-9.67036
▁주시면	-9.67045
▁자	-9.6705
▁계산하는	-9.67103
▁자바	-9.67132
▁500	-9.67184
.5	-9.67197
▁있음	-9.67287
▁두고	-9.67385
좋은	-9.67522
▁보니까	-9.67601
력	-9.67665
▁이분탐색	-9.67708
(1	-9.6771
▁카운트	-9.67757
▁풀어야	-9.67769
▁조건은	-9.67779
▁신청합니다	-9.67793
▁200	-9.67824
▁부탁드립니다	-9.6792
▁찾기	-9.67929
ex	-9.67945
MAX	-9.67951
▁fgets	-9.67957
▁서버	-9.67961
▁줄과	-9.68167
▁넘지	-9.68176
▁공유	-9.68185
▁const	-9.6819
▁정보를	-9.68206
▁정수로	-9.68237
▁빼고	-9.68312
▁바꿔야	-9.68353
▁제출하면	-9.68411
▁아니지만	-9.68425
▁괄호	-9.68464
▁올릴	-9.68466
result	-9.68551
▁방문한	-9.6856
러	-9.68579
▁unsigned	-9.68605
▁이용하여	-9.68712
▁최단	-9.68724
▁들어가게	-9.68777
좌표	-9.68803
BBBBBBBBBBBBBBBB	-9.68888
▁일반적으로	-9.68952
idx	-9.6902
▁감사해요	-9.69105
queue	-9.69124
▁시도	-9.6928
▁반례드립니다	-9.69301
▁로직	-9.69318
io	-9.69329
▁끝나는	-9.69338
▁지점	-9.69488
▁인덱스가	-9.69561
");	-9.69645
▁사이트	-9.69693
▁정상	-9.69745
while	-9.69762
29	-9.69768
▁합을	-9.69829
▁사이의	-9.69936
▁출력하게	-9.70065
▁정점을	-9.70079
problem	-9.70138
▁소스를	-9.70171
▁예외처리	-9.70325
▁그룹	-9.704
▁프로그램은	-9.70475
▁끝까지	-9.705
▁클	-9.70587
▁평균	-9.70623
로는	-9.7064
▁질문에	-9.70644
내	-9.70656
▁종류	-9.70658
(1,	-9.7084
▁bool	-9.70946
사실	-9.70985
▁건지	-9.71003
▁입력에서	-9.71014
▁저장할	-9.71082
▁정수를	-9.71161
▁설명을	-9.7119
없이	-9.71214
▁score	-9.71255
▁사용하여	-9.71353
▁발생하지	-9.71406
▁생각하시면	-9.71426
▁실제로는	-9.7144
해주시면	-9.71541
이하	-9.71574
구요	-9.71578
▁어디가	-9.71591
▁간단하게	-9.71603
▁돌리면	-9.71687
▁된다	-9.71749
좀	-9.71813
▁하나로	-9.71851
▁이중	-9.71854
▁받으면	-9.71967
집니다	-9.71976
33	-9.71981
▁나오고	-9.72047
▁자체를	-9.72098
jh	-9.72103
▁노드가	-9.72144
▁5,	-9.72284
help	-9.723
front	-9.72324
▁판정	-9.72364
▁같아	-9.72368
▁드리자면	-9.72444
get	-9.72463
(?)	-9.7249
▁되	-9.72516
node	-9.7254
▁구분	-9.72582
▁70	-9.72627
▁작성한	-9.72805
▁구조	-9.72895
간	-9.72918
▁상황이	-9.72945
46	-9.73035
▁과정이	-9.73047
31	-9.73055
함	-9.73092
▁제곱	-9.73136
▁봐야	-9.7323
▁이라고	-9.7329
▁메시지	-9.73292
▁INF	-9.73293
▁토마토	-9.73317
▁봤는데	-9.7332
으니	-9.73446
▁경우에도	-9.73457
되	-9.73521
하며	-9.73559
▁확실히	-9.73614
48	-9.73639
▁오타가	-9.73701
28	-9.7371
▁아래의	-9.73728
▁절대	-9.7379
▁않는다	-9.73885
▁땐	-9.7398
▁대략	-9.73995
▁열심히	-9.74016
▁문제인지	-9.74023
되기	-9.74064
▁나누는	-9.74099
▁아무런	-9.74168
▁있도록	-9.74171
▁조건문	-9.74196
▁이상하게	-9.74352
▁대신에	-9.74391
▁보이는	-9.74395
▁인자로	-9.74399
05013	-9.74481
▁나오면	-9.74483
▁없다	-9.74527
96	-9.74568
▁되나요	-9.74587
▁예제는	-9.7464
▁판단	-9.74698
하거나	-9.74741
되는데	-9.74761
▁한번만	-9.74862
or	-9.74864
▁적어도	-9.74866
▁돌면서	-9.74867
▁일반적인	-9.75056
▁백준에서	-9.75128
까지는	-9.7516
▁계산을	-9.75162
▁동적할당	-9.75251
여야	-9.75539
▁뜨는	-9.75553
▁집	-9.75611
▁질문이	-9.75646
▁주는	-9.75993
더라구요	-9.76064
▁배워갑니다	-9.76125
▁케이스마다	-9.76132
▁65	-9.76138
어서	-9.76159
▁경로가	-9.76288
▁다를	-9.76318
▁아니기	-9.7636
▁번에	-9.76434
▁들어있는	-9.7646
▁첫째	-9.76551
▁[1,	-9.76566
▁idx	-9.76604
▁몰랐네요	-9.76725
개만	-9.76729
▁o	-9.76736
▁올바르게	-9.7675
▁자체	-9.76843
▁아닐까	-9.76872
▁번호가	-9.76899
▁조합	-9.77013
여서	-9.77038
문제에서	-9.77086
▁사용하시면	-9.77098
▁감사합니당	-9.77185
▁자료형을	-9.77283
▁나네요	-9.77423
성	-9.77495
▁아마도	-9.77513
▁존재하는	-9.77589
▁data	-9.77628
해보시면	-9.77645
▁동안	-9.77667
▁없으니	-9.77671
▁표현할	-9.77672
번은	-9.7777
▁연산은	-9.77808
▁홀수	-9.7788
▁주소	-9.77956
로만	-9.77962
▁역할	-9.77992
▁재귀함수	-9.78014
▁함수에	-9.78065
▁예상	-9.78073
▁입력값	-9.7821
cin	-9.78236
▁[0,	-9.7825
▁변수로	-9.78264
배열의	-9.78273
▁올려	-9.78378
▁짧은	-9.78402
▁문제도	-9.78438
▁만족하는	-9.78476
▁여기에	-9.78507
부분	-9.78577
일까요	-9.78598
▁하는지	-9.78611
▁높이	-9.78684
*(	-9.78691
▁리스트에	-9.78704
▁답글	-9.78709
▁상당히	-9.78719
▁검색을	-9.78721
▁나타내는	-9.7884
며	-9.78868
▁여러번	-9.78877
정도	-9.78971
▁나왔습니다	-9.78997
▁약수	-9.79028
▁error	-9.7904
▁집합	-9.79053
▁고맙습니다	-9.7912
▁test	-9.79153
▁학생	-9.79159
▁보이네요	-9.79167
▁간선을	-9.79197
▁ᅮ	-9.79206
▁메소드	-9.79219
▁때만	-9.79267
▁프로그래밍	-9.79325
▁지문	-9.79395
▁ᄏᄏᄏᄏ	-9.79395
▁문제였습니다	-9.79414
▁나지	-9.79453
41	-9.79461
▁들어서	-9.79517
▁힌트	-9.79523
-1,	-9.79633
▁스택에	-9.79638
▁완전	-9.79653
▁없는지	-9.7969
▁생각됩니다	-9.7975
▁들어간	-9.79799
▁표준	-9.79881
▁순서로	-9.79904
▁들	-9.79997
▁복잡도가	-9.8002
▁자리수	-9.80029
▁Q	-9.80043
▁통과됩니다	-9.80047
줄에서	-9.80047
수도	-9.80097
▁문법	-9.80099
▁존재	-9.80102
화	-9.8023
라인	-9.80275
▁읽어보세요	-9.80321
▁알았습니다	-9.80328
▁이라는	-9.80392
▁들면	-9.80426
수가	-9.80463
▁케이스는	-9.80527
/3	-9.80534
▁Main	-9.80567
끼리	-9.80577
▁로직을	-9.80723
▁포함	-9.80724
▁처리할	-9.80766
겠지만	-9.80859
▁해봤는데	-9.80882
▁써도	-9.80947
▁number	-9.8121
▁데에	-9.81266
▁단어	-9.8127
+2	-9.8135
▁스스로	-9.81393
▁해결했어요	-9.81405
▁영역	-9.81453
▁전역	-9.81463
kg	-9.81499
있습니다	-9.81542
▁변	-9.81569
▁아니라면	-9.81798
▁하나가	-9.81822
▁그럴	-9.81835
49	-9.81934
▁말은	-9.81939
▁런타임에러	-9.82068
▁난이도	-9.82123
▁st	-9.82142
줄에	-9.82182
보	-9.82426
▁상	-9.82456
했더니	-9.82549
▁예제가	-9.82555
▁문제점	-9.82617
wiki	-9.82686
▁비교를	-9.82781
▁계산할	-9.82879
참고로	-9.8295
만개	-9.83076
▁key	-9.83136
▁top	-9.83138
▁데이터에	-9.83226
이거	-9.83228
▁정답처리	-9.83261
▁그거	-9.83305
[-1]	-9.83327
▁지적	-9.83408
vector	-9.83439
본	-9.8349
▁최댓값이	-9.83527
▁정점이	-9.83583
▁parent	-9.83657
▁BufferedReader	-9.83671
▁짝수	-9.83676
▁이용한	-9.83687
▁카드	-9.83705
▁ios	-9.83709
▁가까운	-9.83713
▁들어갑니다	-9.83726
▁관계	-9.83768
▁오류를	-9.83824
▁쿼리	-9.83852
만으로	-9.83917
▁얼마	-9.83952
▁봐도	-9.84031
▁된다고	-9.84074
(2)	-9.84096
▁수정하면	-9.84142
▁이면	-9.842
▁등을	-9.8421
▁가정	-9.84225
▁작성자님	-9.84302
▁연습	-9.84317
으	-9.84322
▁양	-9.84356
▁함께	-9.84406
▁접근하는	-9.84429
▁저지	-9.84431
▁큐에서	-9.84437
▁공백으로	-9.84444
▁봅시다	-9.84476
▁여러개	-9.84478
그래도	-9.84495
▁지역	-9.84508
▁61	-9.84601
▁커서	-9.84604
거죠	-9.84869
▁중간	-9.8489
93	-9.85158
▁알게	-9.8516
▁없다면	-9.8518
것을	-9.85238
▁가로	-9.85437
▁존재합니다	-9.85508
println	-9.85553
▁54	-9.8564
▁해요	-9.85653
▁글에	-9.85655
거라	-9.85702
▁말씀하신대로	-9.85822
부	-9.85848
▁크기의	-9.85888
되어야	-9.86001
▁질문글	-9.8604
▁사용합니다	-9.86061
▁res	-9.86091
▁나머지를	-9.86153
▁이해하고	-9.86198
▁블로그	-9.86255
▁이상이	-9.86339
▁임의의	-9.86386
▁공식	-9.86388
▁적	-9.86414
▁띄어쓰기	-9.86506
▁곳에	-9.86629
▁최댓값	-9.86664
▁뭔지	-9.8669
달	-9.86701
▁들어가서	-9.86726
]]	-9.86762
말고	-9.8685
▁공개	-9.86873
▁한참	-9.87014
▁정말로	-9.87213
이니까	-9.87341
NULL	-9.87356
ᄏᄏᄏ	-9.87525
][0]	-9.87566
▁우리	-9.87585
▁되세요	-9.87659
비	-9.87764
▁바꾼	-9.87797
▁개수는	-9.87883
▁할까요	-9.87936
▁반환합니다	-9.88031
▁풀었는데	-9.88032
▁탈출	-9.88081
▁하더라도	-9.88114
▁보지	-9.88247
▁때도	-9.88264
▁생각해보니	-9.88408
▁계속해서	-9.88414
▁대체	-9.88439
▁해보겠습니다	-9.88491
▁넘어가는	-9.88534
ᄒ	-9.88573
▁이름	-9.88623
▁명령	-9.8864
cur	-9.88695
▁얼마나	-9.88736
▁제외한	-9.88778
▁단위로	-9.88867
▁그림	-9.88926
▁맞았다고	-9.89054
▁overflow	-9.89065
▁게시판에	-9.89076
▁있죠	-9.89102
▁사용해	-9.89129
▁01	-9.89215
▁넘어갈	-9.89252
65	-9.89369
▁쓰시면	-9.89485
▁고쳐서	-9.8952
▁곳이	-9.89604
▁된다면	-9.89665
해요	-9.89814
▁compare	-9.89821
▁가지는	-9.89854
▁이용하면	-9.89895
second	-9.89928
▁횟수가	-9.90177
▁어떠한	-9.90256
▁loop	-9.90271
▁것인지	-9.90411
51	-9.90436
▁어디	-9.90503
▁정리	-9.90549
▁번역	-9.90578
▁elif	-9.90709
▁((	-9.90779
▁인접한	-9.90781
▁주소를	-9.90834
▁함수로	-9.90844
▁큽니다	-9.90871
▁크거나	-9.90881
▁여부를	-9.90888
▁out	-9.90899
▁동작을	-9.90912
▁도시	-9.90972
▁제출하신	-9.91087
▁그리디	-9.91188
▁상황에서	-9.91215
▁찾고	-9.91239
▁tree	-9.91345
▁넣은	-9.91367
▁사	-9.91407
중에	-9.91425
공백	-9.91426
al	-9.91515
▁존재할	-9.91566
식	-9.91603
▁알고리즘은	-9.91656
코드를	-9.91676
▁있으며	-9.91685
이게	-9.91698
▁동전	-9.91715
▁사람의	-9.91738
▁하셨는데	-9.91775
▁9999	-9.91812
▁쓰레기	-9.9191
▁로직이	-9.9192
▁제출한	-9.91925
▁하나하나	-9.91946
되었습니다	-9.91961
*2	-9.91989
세	-9.92082
▁실수가	-9.92102
▁두개	-9.92141
▁저장하고	-9.92169
틀렸습니다	-9.92192
▁속도가	-9.92284
▁입력된	-9.92298
주시면	-9.92361
▁의견	-9.92389
▁과정	-9.9243
▁찾은	-9.92466
▁칸이	-9.92469
▁인데	-9.92479
져	-9.9253
▁돌고	-9.92584
▁결정	-9.92586
▁오늘	-9.92736
le	-9.92768
90	-9.92795
▁대부분	-9.928
ᅲᅲᅲ	-9.92828
▁메서드	-9.92837
▁차	-9.9285
sys	-9.92971
▁46	-9.93014
▁입력되는	-9.93052
하세요	-9.93053
▁remove	-9.9306
했다고	-9.93095
▁걸까요	-9.93193
▁나머지가	-9.93194
▁기본적인	-9.93258
▁짠	-9.93297
▁가리키는	-9.93299
▁랜덤	-9.93316
▁문장이	-9.93318
▁별로	-9.93341
▁heap	-9.93392
▁복잡도	-9.93519
▁맞다고	-9.93543
▁얘기	-9.93573
▁비용	-9.93583
base	-9.93634
▁되지만	-9.93658
++){	-9.93661
▁(1)	-9.93668
▁논리	-9.93672
59	-9.93741
첫	-9.93776
▁cost	-9.93804
해보세요	-9.939
▁만족	-9.93905
해주셔서	-9.93925
▁올린	-9.93946
▁정수가	-9.93946
▁주어지지	-9.93971
▁없어요	-9.9399
is	-9.94089
컴파일	-9.94094
▁활용	-9.94096
▁글이	-9.94104
것도	-9.94128
▁이유로	-9.94168
▁수정하니	-9.94195
▁모르겠는데	-9.94204
▁돌려	-9.94256
▁YES	-9.94283
님의	-9.94332
▁버전	-9.94343
▁^	-9.94399
▁56	-9.94461
▁최소값	-9.94463
▁원인은	-9.9447
▁해주는	-9.94582
▁힌트를	-9.94583
▁연결된	-9.9464
▁시간은	-9.94656
top	-9.9472
▁무한루프	-9.94729
to	-9.94772
▁모르는	-9.94781
▁받지	-9.94868
▁걸릴	-9.94961
▁정수형	-9.95001
▁놓고	-9.95015
▁하는게	-9.95024
spot	-9.95039
▁않았지만	-9.95046
▁의도한	-9.95046
▁추천합니다	-9.9508
▁이루어진	-9.95086
▁나와요	-9.95142
▁하셔야	-9.95185
▁gets	-9.95191
▁처리하는	-9.95214
초에	-9.95217
▁형	-9.95266
또	-9.95284
▁별개로	-9.95298
38	-9.95309
▁대부분의	-9.95319
▁둘다	-9.95336
▁47	-9.95372
▁틀렸는지	-9.95433
▁정답으로	-9.95502
▁(1,	-9.95566
▁자체는	-9.95568
00	-9.95616
▁뜻이	-9.95679
어야	-9.95751
▁케이스에	-9.95881
▁해주셔야	-9.95907
▁구현할	-9.95954
▁못했습니다	-9.96038
[5]	-9.96064
▁Java	-9.96138
>>	-9.96169
▁구현이	-9.96193
▁숫자로	-9.96248
▁자주	-9.96282
▁곱	-9.96285
▁불	-9.96334
▁구성	-9.96409
());	-9.96417
▁반	-9.96439
▁반환하는	-9.96449
▁보기	-9.96453
▁환경	-9.96487
▁flush	-9.96515
▁재	-9.96543
▁300	-9.96587
▁것보다	-9.96612
▁아닌가	-9.96626
▁넘는	-9.96638
정렬	-9.96684
▁최댓값을	-9.96878
▁예제도	-9.96959
▁무	-9.96982
▁불구하고	-9.96992
▁다들	-9.96997
▁바꿔보세요	-9.96999
▁부	-9.97081
▁변수는	-9.97098
해결	-9.97127
▁getchar	-9.97264
▁하므로	-9.97266
▁time	-9.97286
▁바	-9.97293
▁환경에서	-9.97315
▁이동할	-9.97331
▁구한	-9.97375
goodday	-9.97388
▁아닌지	-9.97407
▁넣었을	-9.97535
▁제외	-9.97538
▁식을	-9.97556
잘	-9.97642
34	-9.97647
▁반올림	-9.97759
▁남깁니다	-9.97785
▁무엇인지	-9.97796
▁마다	-9.97809
▁인접	-9.97826
000	-9.97843
▁공간을	-9.97865
▁53	-9.97879
▁문자열은	-9.97966
:1	-9.98079
▁자료	-9.98191
98	-9.98302
44	-9.98304
▁못해서	-9.98305
▁u	-9.98378
▁가진	-9.98403
하셔서	-9.98455
▁81	-9.98526
39	-9.98547
▁오는	-9.98561
▁주어질	-9.98565
▁모릅니다	-9.98583
▁복붙	-9.98626
▁나무	-9.9864
▁간선의	-9.98641
▁63	-9.98642
▁거죠	-9.98647
cout	-9.98648
▁시간에	-9.98682
▁내용은	-9.98683
하나요	-9.98683
추가로	-9.98822
▁수정한	-9.98845
▁더하는	-9.98879
▁것이기	-9.98904
▁받아야	-9.98947
▁바꿀	-9.98984
▁어렵습니다	-9.98988
▁부분도	-9.98991
ocode	-9.98995
▁순	-9.99001
▁nx	-9.99186
word	-9.99195
79	-9.99197
하다가	-9.99214
:)	-9.99294
github	-9.99387
▁보면서	-9.99415
초가	-9.99422
▁TLE	-9.99447
▁파이썬으로	-9.99477
▁키	-9.99615
▁사람들	-9.99622
new	-9.99687
▁답변해주셔서	-9.99698
▁97	-9.99726
▁하나요	-9.99843
▁그것	-9.99889
▁인덱스는	-9.99921
▁중복된	-10
▁type	-10.0009
▁백트래킹	-10.0009
▁발견	-10.0012
▁128	-10.0014
▁생각해보면	-10.0021
▁하여	-10.0025
▁뭘	-10.0025
▁pair	-10.0027
▁고쳐야	-10.0032
▁분들이	-10.0038
▁없게	-10.0048
97	-10.0057
▁양수	-10.0058
▁않도록	-10.0061
▁선언한	-10.0063
▁사이클이	-10.0064
▁빨리	-10.0069
▁반복문이	-10.0076
▁와우	-10.0109
▁Y	-10.0114
▁거라고	-10.0128
이에요	-10.0135
▁first	-10.0135
bound	-10.0137
▁**	-10.0144
Inc	-10.0146
▁풀어서	-10.0158
!=	-10.0161
▁올리신	-10.0162
▁상관이	-10.0165
▁ᅲᅲᅲᅲ	-10.0171
▁메모이제이션	-10.0174
가요	-10.0174
바로	-10.018
ab	-10.0183
stackoverflow	-10.0184
수정	-10.0186
▁답변이	-10.0187
답은	-10.0188
란	-10.019
▁적어	-10.0205
▁무엇이	-10.0205
▁풀기	-10.0216
메모리	-10.0218
▁고쳐	-10.0219
▁cur	-10.0226
만을	-10.0235
▁아이디어	-10.0238
▁ny	-10.024
▁첨부	-10.0241
▁차이는	-10.0242
▁온라인	-10.0242
▁드렸습니다	-10.0251
readLine	-10.0262
double	-10.0262
▁체크하는	-10.0269
▁맞았네요	-10.027
▁이용	-10.0274
▁나오는지	-10.0284
▁부족한	-10.0297
▁비해	-10.0307
▁혹시나	-10.0308
▁초기	-10.0309
▁효율적인	-10.0314
37	-10.0316
▁되게	-10.0316
▁틀리네요	-10.0318
▁댓글을	-10.0321
▁57	-10.0322
우선	-10.0348
▁append	-10.0349
▁선언하면	-10.0354
걸까요	-10.036
▁들어가면	-10.0362
▁이해한	-10.0366
▁단어가	-10.0368
안에	-10.0381
▁최적	-10.0391
열	-10.0394
재	-10.0394
같이	-10.0401
▁올	-10.0408
43	-10.0408
▁문자로	-10.0408
▁끝난	-10.0419
바	-10.0425
▁전달	-10.0429
▁계산이	-10.0432
▁습관	-10.0437
▁작업을	-10.0437
겠군요	-10.0442
▁구현하는	-10.0444
▁ᄃᄃ	-10.0449
억번	-10.0452
▁널문자	-10.0459
▁막	-10.0461
▁오름차순으로	-10.0462
지를	-10.0467
▁malloc	-10.0474
되서	-10.0479
--	-10.0485
▁모	-10.0489
▁해주면	-10.0496
번줄에서	-10.0498
▁보	-10.0504
▁비트	-10.0515
▁no	-10.0517
▁이것	-10.0519
61	-10.0521
아니면	-10.0524
▁않는다는	-10.053
해주면	-10.0532
▁알고리즘으로	-10.0532
▁의미합니다	-10.0532
▁지금은	-10.0533
해주는	-10.0538
▁간	-10.0539
▁수밖에	-10.0541
▁복잡도를	-10.0542
▁추가하는	-10.0543
▁실행이	-10.0546
(0,	-10.0548
▁도착	-10.0564
▁추가해서	-10.0565
이런식으로	-10.0566
▁알았네요	-10.0573
▁참고하시면	-10.0573
▁노드의	-10.0576
▁예	-10.0577
▁말씀대로	-10.0578
▁되서	-10.0578
▁전역변수	-10.0592
check	-10.0596
53	-10.0596
연산	-10.0599
층	-10.0602
mid	-10.0605
번에서	-10.0613
123	-10.0613
마	-10.0614
▁없음	-10.0615
결과	-10.0617
이제	-10.0618
▁딱히	-10.0621
행의	-10.0623
▁출력되어야	-10.0623
▁되도록	-10.0624
▁순회	-10.0634
▁class	-10.0638
▁발생하게	-10.0638
▁알려주신	-10.0643
▁맞는지	-10.0654
▁이야기	-10.0657
▁구구구구	-10.0659
▁알려주실	-10.0675
▁total	-10.0681
js	-10.0686
+1,	-10.0687
it	-10.0687
▁사람들이	-10.0688
▁하나는	-10.0689
▁-3	-10.0693
▁않으므로	-10.0694
▁편	-10.0694
▁돌리는	-10.0701
▁말씀하시는	-10.0702
하는게	-10.0705
▁무게	-10.0709
▁시작해서	-10.0714
▁무시	-10.0722
▁푸신	-10.0724
것같습니다	-10.0724
▁테케	-10.0725
▁초기값	-10.0727
▁구구	-10.073
트	-10.073
▁하실	-10.0736
다니	-10.0736
▁물	-10.0737
70	-10.074
였습니다	-10.0741
▁;	-10.0746
▁곱셈	-10.075
▁구하고	-10.0757
▁자식	-10.0763
▁개선	-10.0766
▁단어의	-10.0768
▁gcc	-10.0772
▁ᄒᄒᄒ	-10.0772
ko	-10.0774
▁라인에서	-10.0808
▁좀더	-10.0809
▁공간	-10.0818
보니	-10.0823
▁읽기	-10.0825
▁빠릅니다	-10.0825
▁찾아보세요	-10.0826
▁불가능합니다	-10.0829
▁아래처럼	-10.0835
▁맞는데	-10.0837
▁이것도	-10.0838
▁방	-10.084
▁조건문을	-10.0841
▁지정	-10.0846
▁흠	-10.0848
▁맞	-10.0857
▁조건에서	-10.0859
▁힘들	-10.086
▁피보나치	-10.0862
▁분류	-10.0863
▁5000	-10.0867
python	-10.0873
▁알겠습니다	-10.0878
▁책	-10.0879
▁드디어	-10.0881
▁모듈	-10.0884
▁pow	-10.0886
es	-10.0888
▁지역변수	-10.0893
▁이번	-10.0893
▁했더니	-10.0906
at	-10.0916
77	-10.0916
Input	-10.0917
▁생각해보시면	-10.0919
▁보시는	-10.0919
▁들어가지	-10.0919
▁출력되지	-10.0927
▁수정해	-10.0927
▁감사	-10.0937
문자열	-10.0939
▁좌표를	-10.094
▁받기	-10.094
부분을	-10.0946
길	-10.0969
EC	-10.0978
▁마시고	-10.0979
글	-10.0981
▁하면서	-10.0989
36	-10.0994
▁해주세요	-10.0995
▁오름차순	-10.0997
▁바꿔도	-10.0998
42	-10.0999
▁정렬된	-10.1001
etrecursionlimit	-10.1004
10000	-10.1006
▁판별	-10.1006
▁모르고	-10.1007
main	-10.1008
▁추가하면	-10.1009
▁나와	-10.1011
운	-10.1016
▁1001	-10.1021
가장	-10.1025
09	-10.1027
▁보장	-10.103
▁기록	-10.103
▁수정하고	-10.1031
▁static	-10.1032
▁이고	-10.1039
▁읽는	-10.1041
▁"\	-10.105
visited	-10.1054
▁있군요	-10.106
문제는	-10.1063
최대	-10.1069
만에	-10.1088
▁안되고	-10.109
▁얻을	-10.1091
▁주어지면	-10.1095
▁코드처럼	-10.1097
tmp	-10.11
]=	-10.1101
▁'.'	-10.1111
▁같지	-10.1114
▁gcd	-10.1116
▁통과할	-10.1127
▁보이는데	-10.1136
▁세로	-10.1145
▁두번	-10.1146
시는	-10.1147
▁행렬	-10.1155
텐데	-10.1157
▁출제자	-10.1158
에요	-10.1167
66	-10.1172
▁비교할	-10.1175
▁생각하는	-10.1181
▁생각한	-10.1182
▁있었던	-10.1183
▁틀릴	-10.1184
▁틀렸네요	-10.1188
▁단계	-10.1189
String	-10.119
▁문장을	-10.1191
보면	-10.1191
▁회전	-10.1192
▁바꾸어	-10.1201
되네요	-10.1213
52	-10.1214
행에서	-10.1216
▁쓰레기값이	-10.1218
▁여러가지	-10.1226
▁형식이	-10.1227
▁만들면	-10.1233
data	-10.1234
▁방식은	-10.1235
했	-10.1236
▁정해	-10.1242
▁찾지	-10.1249
▁말하는	-10.1252
▁경우엔	-10.1256
▁작을	-10.1256
▁생각보다	-10.1259
▁성공	-10.1265
마지막	-10.1277
만한	-10.128
▁재귀호출	-10.1288
날	-10.1288
▁경우만	-10.1292
숫자	-10.1295
▁필요할	-10.1301
id	-10.1301
▁돌게	-10.1303
방향	-10.1304
더군요	-10.1311
▁flag	-10.1318
하시고	-10.133
▁by	-10.1331
Output	-10.1332
결국	-10.1332
03	-10.134
한번	-10.1343
번째줄에	-10.1351
▁sc	-10.1362
길이	-10.1364
=3	-10.1364
▁것인데	-10.1365
▁공	-10.137
승	-10.1375
▁탐색하는	-10.1387
▁length	-10.1395
▁들어가야	-10.1396
▁배열에서	-10.1402
번과	-10.1409
▁비용이	-10.1411
▁것이죠	-10.1413
하긴	-10.1413
▁pq	-10.1414
▁감사합니다ᅲᅲ	-10.1419
▁round	-10.1421
▁예정입니다	-10.1422
Answer	-10.1426
▁사전순으로	-10.1429
▁공간이	-10.1438
번만	-10.1439
▁이용하는	-10.1445
네용	-10.1457
▁모르겠어요	-10.1464
62	-10.1464
해주세요	-10.1466
dfs	-10.1468
▁없	-10.147
▁내부에서	-10.1474
이걸	-10.1479
▁리스트로	-10.1483
▁사용하기	-10.1489
세요	-10.149
함수가	-10.149
.4	-10.1496
▁고려해야	-10.15
줄의	-10.1509
▁더한	-10.1511
▁벗어나	-10.1514
▁증가하는	-10.1519
▁지금까지	-10.1521
동	-10.1521
▁작업	-10.1523
냐	-10.1525
▁전역변수로	-10.1526
▁복사해서	-10.1526
35	-10.1539
logN	-10.1539
▁완료	-10.1539
▁하려면	-10.1543
▁복잡도는	-10.1545
▁크면	-10.1549
▁생각도	-10.1549
것은	-10.1551
▁123	-10.1558
▁있겠죠	-10.1559
▁free	-10.1567
▁파이썬의	-10.1569
▁그러나	-10.1575
▁드리겠습니다	-10.1576
▁추천	-10.1577
▁세그먼트	-10.1578
대신	-10.1581
▁같지만	-10.1588
▁줄부터	-10.1593
▁풀이는	-10.1605
wikipedia	-10.1606
▁찾아야	-10.1616
번줄에	-10.1619
std	-10.1622
▁두분	-10.1623
▁명령어	-10.1625
▁기존의	-10.1627
▁안되서	-10.1636
67	-10.1643
값은	-10.1646
▁분리	-10.165
형을	-10.1651
▁알아	-10.1652
▁모르지만	-10.1654
57	-10.1655
▁오버플로	-10.1659
그렇다면	-10.1667
▁인풋	-10.1671
;}	-10.1672
셔야	-10.1682
▁버퍼에	-10.1684
▁대문자	-10.1685
▁유지	-10.1687
▁기	-10.1688
▁합시다	-10.1689
▁편이	-10.169
▁100,000	-10.1694
▁6,	-10.1698
▁모르겠으나	-10.1702
했는지	-10.1705
▁시간초과를	-10.1708
stack	-10.1716
▁않았기	-10.1717
NlogN	-10.1729
범위	-10.173
45	-10.1737
하셔야	-10.1745
▁쓰	-10.1749
▁자꾸	-10.1758
▁보겠습니다	-10.1763
▁추측	-10.1764
▁입출력을	-10.1764
시켜	-10.1766
▁BufferedWriter	-10.1769
▁실패	-10.177
▁2^	-10.1772
셔서	-10.1773
54	-10.1777
▁하시는	-10.178
▁접근할	-10.1781
80	-10.1782
만큼의	-10.1783
▁의미입니다	-10.1785
aaaaaaaaaaaaaaaa	-10.1793
했기	-10.1798
▁남겨주세요	-10.1799
▁싶은	-10.1805
▁감사드려요	-10.1806
▁새	-10.181
begin	-10.1813
▁58	-10.1818
▁도와	-10.182
▁숫자의	-10.182
▁이루어져	-10.1829
▁Z	-10.1837
▁담을	-10.1838
left	-10.1844
mod	-10.1845
▁바뀐	-10.1847
해줘야	-10.1848
▁생각했습니다	-10.1857
startlink	-10.1858
▁혼자	-10.186
문제의	-10.1861
▁배우고	-10.1863
알고리즘	-10.1867
▁qsort	-10.1873
거든요	-10.1876
변수	-10.1877
미	-10.1879
▁출력한	-10.1879
▁확인을	-10.188
▁안될	-10.1893
▁덧셈	-10.1909
▁감	-10.1914
개씩	-10.1916
▁이기	-10.1922
▁길	-10.1924
▁참고해서	-10.1926
▁조금만	-10.1931
▁건데	-10.1938
63	-10.1943
▁규칙을	-10.1943
▁있겠지만	-10.1947
▁동일하게	-10.1948
▁상태가	-10.195
▁추가해	-10.1959
▁컴파일러가	-10.1963
▁스페셜	-10.1973
▁상관없이	-10.1973
",&	-10.1976
▁의미를	-10.1984
▁식이	-10.1985
▁사용하시는	-10.1987
▁줄로	-10.1989
이미	-10.199
▁나눠서	-10.2001
time	-10.2003
더라고요	-10.2007
▁작성해	-10.2008
▁해주시면	-10.2011
채점	-10.2015
였군요	-10.2018
였네요	-10.2022
▁66	-10.2024
**	-10.2025
위에	-10.2029
▁드릴게요	-10.2032
▁형식으로	-10.2035
없	-10.2043
’	-10.2045
▁바꾸시면	-10.2045
▁좋겠네요	-10.2046
▁증명	-10.2049
▁구해야	-10.2062
▁원소들	-10.2063
맨	-10.2064
▁만족하지	-10.2066
▁};	-10.2069
▁생각할	-10.2078
▁윗	-10.208
있	-10.2082
▁넣어도	-10.2082
▁제외하고	-10.2084
▁400	-10.2086
▁읽을	-10.2095
cppreference	-10.2095
되므로	-10.2099
▁알파벳이	-10.2104
▁팀	-10.2109
▁알아서	-10.2111
테스트	-10.2113
▁불가능한	-10.2114
▁출발	-10.2115
▁제출하니	-10.2118
▁StringBuilder	-10.2119
▁명시	-10.212
으로는	-10.2121
▁아직도	-10.2122
너무	-10.2135
▁되어있습니다	-10.214
▁다시한번	-10.2142
▁검사하는	-10.2144
▁방문할	-10.2144
47	-10.2148
▁의미하는	-10.2151
▁달리	-10.2153
▁있긴	-10.2154
▁나오기	-10.2156
▁비슷하게	-10.2158
줄을	-10.2159
▁재귀로	-10.2162
▁주어졌을	-10.2163
▁있어도	-10.2163
런타임	-10.2164
▁문자는	-10.2164
▁111	-10.2167
방	-10.2169
▁로컬에서	-10.2171
▁비교해서	-10.2173
▁달아	-10.2175
▁봤을	-10.2176
▁이름을	-10.2179
되어서	-10.2188
실제로	-10.2192
(3)	-10.2199
리스트	-10.22
▁대해서도	-10.2205
▁퀵소트	-10.2207
▁값과	-10.2208
▁벗어나는	-10.2211
나서	-10.2217
▁블록	-10.2217
void	-10.2217
▁실행되지	-10.2217
▁앞의	-10.2218
으므로	-10.2228
▁예시로	-10.2229
▁텐데	-10.2233
▁고쳤	-10.2242
▁그러니까	-10.2245
▁벗어난	-10.2246
▁되겠습니다	-10.2248
거같네요	-10.2248
▁나누기	-10.2254
▁추가적으로	-10.2255
▁계산한	-10.2255
▁그때	-10.2267
01	-10.2273
▁빠져	-10.2273
▁등등	-10.2277
레	-10.2281
-2)	-10.2283
/4	-10.2284
▁돼요	-10.2285
▁언제	-10.2298
▁be	-10.2301
▁뿐만	-10.2303
▁구현한	-10.231
▁낮은	-10.2314
sqrt	-10.2321
진짜	-10.2322
▁피	-10.2323
▁StringTokenizer	-10.2325
오답	-10.2328
▁파악	-10.2328
▁대	-10.2332
번째줄에서	-10.2336
04	-10.2336
지도	-10.2339
▁distance	-10.234
▁아무래도	-10.2347
▁덜	-10.2354
▁우	-10.2358
▁get	-10.236
▁곳에서	-10.2371
dist	-10.2375
▁dy	-10.2387
축	-10.2396
▁확장	-10.2397
▁board	-10.2403
▁다양한	-10.2407
▁원본	-10.2412
▁문제였군요	-10.2413
▁잡고	-10.2413
▁결과값이	-10.2415
▁점은	-10.2416
▁assert	-10.2417
▁포함되어	-10.2424
▁형변환	-10.2425
right	-10.2426
sizeof	-10.2426
▁merge	-10.2427
▁소문자	-10.2435
▁붙여	-10.2435
▁의도하신	-10.2436
▁추가하고	-10.244
해보겠습니다	-10.2441
▁없지	-10.2442
함수는	-10.2447
▁꼼꼼히	-10.2452
▁알아보세요	-10.2452
▁언급	-10.2454
▁어디에	-10.2455
▁감이	-10.2459
▁게임	-10.2461
▁front	-10.2464
▁빼는	-10.2466
▁찾으면	-10.2467
▁원문	-10.2473
이죠	-10.2473
..!!	-10.2474
▁무엇을	-10.2477
empty	-10.2477
▁없애	-10.2482
▁쌍	-10.2491
▁쓰기	-10.2493
;;;	-10.2498
ation	-10.2501
점이	-10.2502
▁수정을	-10.2507
▁할지	-10.251
▁올리는	-10.2519
▁넣어야	-10.2522
▁72	-10.2528
▁75	-10.253
심	-10.2536
▁해보니	-10.2537
▁실행하면	-10.2541
▁'1'	-10.2542
2000	-10.2548
▁답변감사합니다	-10.2548
li	-10.2555
▁함수입니다	-10.2556
▁적힌	-10.2557
추가	-10.2559
▁커질	-10.2562
▁수학	-10.2564
▁만들기	-10.2566
▁하나도	-10.2568
...)	-10.2573
호	-10.2576
cc	-10.2578
>=	-10.2581
▁중복되는	-10.2585
▁쓰신	-10.2586
거같아요	-10.2588
▁구조체	-10.2589
로도	-10.259
][1]	-10.2592
▁지원	-10.2601
▁사실을	-10.2601
add	-10.2605
▁해제	-10.2608
▁돌아갑니다	-10.2609
▁만들어야	-10.2617
****************	-10.262
▁스택이	-10.2629
▁적게	-10.263
▁안하고	-10.2634
define	-10.2636
▁쓰인	-10.2645
▁보실	-10.2647
▁넣지	-10.2658
트리	-10.2661
▁있으신가요	-10.2662
▁re	-10.267
▁3)	-10.2671
▁태그	-10.2673
▁범위에	-10.2678
▁지우면	-10.2682
▁코드로는	-10.2692
▁않는다면	-10.2694
▁저장된	-10.2694
▁속	-10.2696
find	-10.2702
▁마지막으로	-10.2705
▁초기화하는	-10.2709
wwwwwwwwwwwwwwww	-10.271
▁copy	-10.2713
▁작습니다	-10.2716
▁높습니다	-10.2716
▁search	-10.2716
말	-10.2716
됨	-10.2725
▁그런거	-10.2727
또는	-10.2727
▁감소	-10.2728
▁달아주셔서	-10.2728
on	-10.2729
▁곧	-10.2729
▁부동소수점	-10.2732
▁abs	-10.274
하다	-10.2752
▁lst	-10.2752
▁문을	-10.2753
▁(0,	-10.2756
▁그에	-10.2758
▁방법입니다	-10.2758
▁고정	-10.2759
▁at	-10.2761
인데요	-10.2762
▁구하면	-10.2763
(0);	-10.2763
▁들어가고	-10.2773
▁많아서	-10.2773
▁않았는데	-10.2775
매	-10.2778
하였습니다	-10.278
▁dx	-10.2786
▁파이썬에서	-10.2786
▁최종	-10.2788
▁사소한	-10.2788
르	-10.2793
▁98	-10.2796
▁아닌데	-10.2799
return	-10.2799
별	-10.28
문제가	-10.2801
List	-10.2805
했고	-10.2805
처음	-10.281
▁나면	-10.2816
▁값들을	-10.2818
...!	-10.2819
ch	-10.2825
첫번째	-10.2833
하더라도	-10.2836
했다면	-10.284
절	-10.2841
▁보다는	-10.2845
터	-10.2847
▁이해하기	-10.2849
어떻게	-10.2854
▁아스키	-10.2857
땐	-10.2863
▁남겨	-10.2864
▁실력	-10.2867
▁달라질	-10.2877
값으로	-10.2877
▁누르면	-10.2878
▁표현이	-10.2881
▁뜨는데	-10.2882
▁내가	-10.2882
!!!!!	-10.2882
▁아이고	-10.2883
999	-10.2885
▁둘째	-10.2886
▁‘	-10.2888
▁depth	-10.2903
▁눈에	-10.2907
▁모양	-10.2908
거같습니다	-10.2909
는게	-10.291
▁단순한	-10.2912
▁결과적으로	-10.2913
▁있는데요	-10.2918
▁구하기	-10.2918
▁자리에	-10.2919
▁Output	-10.292
▁가능할	-10.2922
▁Input	-10.2927
▁따르면	-10.2933
진수	-10.2934
▁ret	-10.2936
87	-10.2936
▁가정하고	-10.2937
▁바이트	-10.2941
▁할때	-10.2941
ad	-10.2942
▁문제일까요	-10.2952
▁돌아가는	-10.2955
▁62	-10.2966
▁우연히	-10.2969
했어요	-10.297
▁지우는	-10.2972
된다는	-10.2981
▁-5	-10.2982
lld	-10.2982
▁초기화하지	-10.2983
▁친구	-10.2985
별로	-10.2985
▁공지사항	-10.2985
</	-10.2988
▁접근하게	-10.2998
▁도달	-10.3
▁수정해야	-10.3001
▁팁	-10.3005
▁갯수가	-10.3006
▁-1,	-10.3007
문자	-10.301
▁나눗셈	-10.3012
길래	-10.3012
-3	-10.3012
▁소스는	-10.3014
▁마	-10.3014
▁주지	-10.3017
▁호출할	-10.3018
▁입력받기	-10.3028
▁yes	-10.303
반복문	-10.3035
소	-10.3037
으로도	-10.3041
▁넘	-10.3044
조차	-10.3044
▁정점의	-10.3046
▁목표	-10.3047
▁주면	-10.3048
▁글자가	-10.3051
92	-10.3057
▁없어도	-10.3057
▁(0	-10.3058
aa	-10.3064
▁숫자는	-10.3064
▁분명	-10.3067
▁ac	-10.3073
▁될것	-10.3073
▁add	-10.3075
<<	-10.3075
abc	-10.308
이란	-10.3081
▁효율적으로	-10.3096
▁놓치고	-10.3097
▁solved	-10.3102
▁보네요	-10.3102
▁br	-10.3105
